In [3]:
import pandas as pd
import seaborn as sns

In [5]:
df = sns.load_dataset('iris')

Q1. List any five functions of the pandas library with execution.

In [7]:
# 1. head() and tail(): Display the first or last rows of the dataFrame.
print(df.head())
print(df.tail())

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [8]:
# 2. describe(): Display the stats of the dataframe.
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [9]:
# 3. shape: return the number of rows and column.
df.shape

(150, 5)

In [11]:
# 4. isna(): get the NaNs.
df.isna().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [13]:
# 5. groupby(): Perform the grouping operation
df.groupby('species').count()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa                50           50            50           50
versicolor            50           50            50           50
virginica             50           50            50           50

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the 
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [15]:
sample = pd.DataFrame({
    'A': [1,2,3,4,5],
    'B': [6,7,8,9,10],
    'C':[11,12,13,14,15]
})
sample

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [22]:
index_range = list(range(10))[1::2]
index_range

[1, 3, 5, 7, 9]

In [24]:
sample = sample.reindex(index_range)
sample

     A    B     C
1  2.0  7.0  12.0
3  4.0  9.0  14.0
5  NaN  NaN   NaN
7  NaN  NaN   NaN
9  NaN  NaN   NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that 
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The 
function should print the sum to the console

In [37]:
sample = pd.DataFrame({
    'Values': [11,21,31,41,51],
})
sample

   Values
0      11
1      21
2      31
3      41
4      51

In [39]:
def df_sum(x):
    """
    Get the sum of first 3 values in the given columns.
    
    Parameters:
    x: elements present in the dataframe
    
    returns:
    Calculates the sum of first 3 index values.
    """
    sum_values=[]
    initial_val =0
    for i in range(len(sample)):
#         Check the index
        if i<=2:
            values = initial_val + sample['Values'][i]
            sum_values.append(values)
    return sum(sum_values)

In [40]:
df_sum(sample['Values'])

63

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [63]:
sentences = [
    "Pandas is a powerful library for data manipulation.",
    "It provides data structures like Series and DataFrame.",
    "Data analysis and manipulation are made easy with pandas.",
    "Python is the programming language used for pandas.",
    "You can perform various operations on data using pandas."
]

# Creating a DataFrame with one column 'Sentences'
df = pd.DataFrame({'Text': sentences})

# Calculate the Word Count.
df['Word_Count'] = df['Text'].apply(lambda x:len(x.split()))

# Display the dataframe
print(df)

                                                Text  Word_Count
0  Pandas is a powerful library for data manipula...           8
1  It provides data structures like Series and Da...           8
2  Data analysis and manipulation are made easy w...           9
3  Python is the programming language used for pa...           8
4  You can perform various operations on data usi...           9

Q5. How are DataFrame.size() and DataFrame.shape() different

In [64]:
df = sns.load_dataset('iris')

In [73]:
# Size returns the cross product of Number of Rows and columns
df.size

750

In [74]:
# Shape returns the Number of Rows and Columns in the dataframe
df.shape

(150, 5)

Q6.c Which function of pandas do we use to read an excel file?

Ans: read_excel(file_path)

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email 
addresses in the format 'username@domain.com'. Write a Python function that creates a new column 
'Username' in df that contains only the username part of each email address.

In [105]:
import pandas as pd

# Sample data with email addresses
data = {'Email': ['johndoe@example.com', 'janesmith@example.com', 'bobjones@example.com']}

# Creating a DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

                   Email
0    johndoe@example.com
1  janesmith@example.com
2   bobjones@example.com

In [106]:
def get_username(df):
    """
    Extracts the username from the 'Email' column and creates a new column 'Username' in the DataFrame.
    
    Parameters:
    df : the input dataframe to extract the username from email
    
    returns:
    df: dataframe with username column.
    """
    df = df.copy()
    df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])
    
    return df

In [107]:
df = get_username(df)
df

                   Email   Username
0    johndoe@example.com    johndoe
1  janesmith@example.com  janesmith
2   bobjones@example.com   bobjones

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects 
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The 
function should return a new DataFrame that contains only the selected rows

In [109]:
sample = pd.DataFrame({
    'A': [1,22,31,4,5],
    'B': [6,7,8,9,10],
    'C':[11,12,13,14,15]
})
sample

    A   B   C
0   1   6  11
1  22   7  12
2  31   8  13
3   4   9  14
4   5  10  15

In [113]:
def filter_dataframe(df):
    """
    Get the rows from the DataFrame where 'A' > 5 and 'B' < 10.

    Parameters:
    df: The input DataFrame with columns 'A', 'B', and 'C'.

    Returns:
    df: A new DataFrame containing only the selected rows.
    """
    # Using indexing to filter rows
    filtered_rows = df[(df['A'] > 5) & (df['B'] < 10)]

    return filtered_rows

In [114]:
sample_df = filter_dataframe(sample)
sample_df

    A  B   C
1  22  7  12
2  31  8  13

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, 
median, and standard deviation of the values in the 'Values' column.

In [116]:
sample = pd.DataFrame({
    'Values': [11,21,31,41,51],
})
sample

   Values
0      11
1      21
2      31
3      41
4      51

In [124]:
def get_stats(df, column_name):
    """
    Get the Mean, Median and Standard Deviation from the DataFrame.

    Parameters:
    df: The input DataFrame.
    column_name: contains the column name

    Returns:
    returns the mean, median and std
    """
    
    stats_df = df.copy()
    df_mean = stats_df[column_name].mean()
    df_median = stats_df[column_name].median()
    df_std = stats_df[column_name].std()
    
    return df_mean, df_median, df_std

In [127]:
mean, median, std = get_stats(sample, 'Values')
print('Mean is: ', mean)
print('Median is:', median)
print('Standard Deviation is: ',std)

Mean is:  31.0
Median is: 31.0
Standard Deviation is:  15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to 
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days 
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and 
should include the current day.

In [169]:
from datetime import datetime, timedelta
# Generate random sales data
np.random.seed(42)
sales_data = np.random.randint(100, 1000, size=20)

# Generate date range for the last 20 days
end_date = datetime.now()
date_range = [end_date - timedelta(days=x) for x in range(20)]

# Create the DataFrame
df = pd.DataFrame({'Date': date_range, 'Sales': sales_data})
df

                         Date  Sales
0  2024-01-02 12:48:59.718351    202
1  2024-01-01 12:48:59.718351    535
2  2023-12-31 12:48:59.718351    960
3  2023-12-30 12:48:59.718351    370
4  2023-12-29 12:48:59.718351    206
5  2023-12-28 12:48:59.718351    171
6  2023-12-27 12:48:59.718351    800
7  2023-12-26 12:48:59.718351    120
8  2023-12-25 12:48:59.718351    714
9  2023-12-24 12:48:59.718351    221
10 2023-12-23 12:48:59.718351    566
11 2023-12-22 12:48:59.718351    314
12 2023-12-21 12:48:59.718351    430
13 2023-12-20 12:48:59.718351    558
14 2023-12-19 12:48:59.718351    187
15 2023-12-18 12:48:59.718351    472
16 2023-12-17 12:48:59.718351    199
17 2023-12-16 12:48:59.718351    971
18 2023-12-15 12:48:59.718351    763
19 2023-12-14 12:48:59.718351    230

In [208]:
def calculate_moving_average(df, window_size=7):
    """
    Calculates the moving average of 'Sales' for the past 7 days.

    Parameters:
    df : The input DataFrame with columns 'Sales' and 'Date'.
    window_size: The size of the moving average window (default is 7).

    Returns:
    df: The DataFrame with the new 'MovingAverage' column.
    """
    # Sort the DataFrame by 'Date' in ascending order
    df = df.sort_values(by='Date')

    # Calculate the moving average using a window of size 7
    df['MovingAverage'] = df['Sales'].rolling(window=7).mean()
    df['MovingAverage'] = df['MovingAverage'].fillna(df['Sales'])
    df = df.reset_index(drop=True)
    
    return df

In [209]:
rolling_sales_avg = calculate_moving_average(df)
rolling_sales_avg

                         Date  Sales  MovingAverage
0  2023-12-14 12:48:59.718351    230     230.000000
1  2023-12-15 12:48:59.718351    763     763.000000
2  2023-12-16 12:48:59.718351    971     971.000000
3  2023-12-17 12:48:59.718351    199     199.000000
4  2023-12-18 12:48:59.718351    472     472.000000
5  2023-12-19 12:48:59.718351    187     187.000000
6  2023-12-20 12:48:59.718351    558     482.857143
7  2023-12-21 12:48:59.718351    430     511.428571
8  2023-12-22 12:48:59.718351    314     447.285714
9  2023-12-23 12:48:59.718351    566     389.428571
10 2023-12-24 12:48:59.718351    221     392.571429
11 2023-12-25 12:48:59.718351    714     427.142857
12 2023-12-26 12:48:59.718351    120     417.571429
13 2023-12-27 12:48:59.718351    800     452.142857
14 2023-12-28 12:48:59.718351    171     415.142857
15 2023-12-29 12:48:59.718351    206     399.714286
16 2023-12-30 12:48:59.718351    370     371.714286
17 2023-12-31 12:48:59.718351    960     477.285714
18 2024-01-01 12:48:59.718351    535     451.714286
19 2024-01-02 12:48:59.718351    202     463.428571

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new 
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. 
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [203]:
date_df = pd.DataFrame({
    'Date' : pd.date_range(start='2024-01-01', end='2024-01-10')
})

def generate_weekday(df, columns_name):
    """
    Returns new column 'Weekday' to the DataFrame with weekday names.
    
    Parameters:
    - df: The input DataFrame with a 'Date' column.
    - columns_name: The name of the 'Date' column.
    
    Returns.
    The updated DataFrame with the new 'Weekday' column.

        
    """
    # Ensure 'Date' column is in datetime format
    df[columns_name] = pd.to_datetime(df[columns_name])

    # Extract weekday names from the 'Date' column
    df['Weekdays'] = df[columns_name].dt.strftime('%A')
    
    return df

In [205]:
generate_weekday(date_df, 'Date')

        Date   Weekdays
0 2024-01-01     Monday
1 2024-01-02    Tuesday
2 2024-01-03  Wednesday
3 2024-01-04   Thursday
4 2024-01-05     Friday
5 2024-01-06   Saturday
6 2024-01-07     Sunday
7 2024-01-08     Monday
8 2024-01-09    Tuesday
9 2024-01-10  Wednesday

In [199]:
date_df['Date'].dt.strftime('%A')

0       Monday
1      Tuesday
2    Wednesday
3     Thursday
4       Friday
5     Saturday
6       Sunday
7       Monday
8      Tuesday
9    Wednesday
Name: Date, dtype: object

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python 
function to select all rows where the date is between '2023-01-01' and '2023-01-31'

In [234]:
def select_rows_in_date_range(df, start_date, end_date, date_column='Date'):
    """
    Selects rows from the DataFrame where the 'Date' column is between start_date and end_date.

    Parameters:
    df: The input DataFrame with a 'Date' column.
    start_date: The start date for the date range.
    end_date: The end date for the date range.
    date_column : The name of the 'Date' column (default is 'Date').

    Returns:
    df : A new DataFrame containing only the selected rows.
    """
    # Convert start_date and end_date to datetime objects
    start_date = pd.to_datetime(start_date)
    end_date = pd.to_datetime(end_date)

    # Use boolean indexing to filter rows based on date range
    selected_rows = df[(df[date_column] >= start_date) & (df[date_column] <= end_date)]

    return selected_rows

In [236]:
df = pd.DataFrame({
    'Date': pd.date_range(start='2023-01-01', end='2023-01-31'),
})

# Call the function to select rows in the specified date range
selected_df = select_rows_in_date_range(df, '2023-01-05', '2023-01-15')

# Display the selected DataFrame
print(selected_df)

         Date
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15

Q13.To use the basic functions of pandas, what is the first and foremost necessary library that needs to 
be imported? <br>
<br>
Ans : import pandas as pd